# HasStarted Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionGroup..::..HasStarted Method
TransactionGroup Class See Also
---
Determines whether the transaction has been started yet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasStarted()
```

Visual Basic
---
```text
Public Function HasStarted As Boolean
```

Visual C++
---
```text
public:
bool HasStarted()
```

# ### Return Value
True if the transaction group has already started, False otherwise.
# Remarks
A transaction group is considered being started after the Start method was called and until the transaction group is either completely committed or rolled back. A transaction group can only be Started when HasStarted returns false.
# See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace